
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодсветитьДлинныйОтпуск();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Год = ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТекущиеДанные.ВсегоДнейОтпуска = (НачалоДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала))
		/ 86400;
		
	ПодсветитьДлинныйОтпуск();

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТекущиеДанные.ВсегоДнейОтпуска = (НачалоДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала))
		/ 86400;
		
	ПодсветитьДлинныйОтпуск();

КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСотрудников(Команда)

	ЗаполнитьСотрудниковНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
Адрес = ВыгрузитьДанныеТаблицы();
ПараметрыФормы = Новый Структура("Адрес", Адрес);
	
ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, Элементы.ОтпускаСотрудников);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ФизическиеЛица.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица";

	Выборка = Запрос.Выполнить().Выбрать();

	Объект.ОтпускаСотрудников.Очистить();

	Пока Выборка.Следующий() Цикл

		НоваяСтрока = Объект.ОтпускаСотрудников.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ВыгрузитьДанныеТаблицы()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания"), 
	УникальныйИдентификатор);
	
КонецФункции 

&НаСервере
Процедура ПодсветитьДлинныйОтпуск()

	УсловноеОформление.Элементы.Очистить();
	
	Оформление = УсловноеОформление.Элементы.Добавить();
	Оформление.Использование = Истина;

	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить( , "Сотрудник, ВсегоДнейОтпуска");
	ТаблицаОтпусков.Свернуть("Сотрудник", "ВсегоДнейОтпуска");

	Для Каждого Колонка Из ТаблицаОтпусков Цикл

		Если Колонка.ВсегоДнейОтпуска > 28 Тогда

			ПолеОформляемое1 = Оформление.Поля.Элементы.Добавить();
			ПолеОформляемое1.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковНомерСтроки");
			ПолеОформляемое2 = Оформление.Поля.Элементы.Добавить();
			ПолеОформляемое2.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковВсегоДнейОтпуска");
			ПолеОформляемое3 = Оформление.Поля.Элементы.Добавить();
			ПолеОформляемое3.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
			ПолеОформляемое4 = Оформление.Поля.Элементы.Добавить();
			ПолеОформляемое4.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаНачала");
			ПолеОформляемое5 = Оформление.Поля.Элементы.Добавить();
			ПолеОформляемое5.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаОкончания");

			Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
			Отбор.ПравоеЗначение = Колонка.Сотрудник;
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование = Истина;
			Оформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);

		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


