
#Область СлужебныеПроцедурыИФункции

Функция ОтправитьСообщениеТГ(КодСостояния) Экспорт
 
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ТекстУведомленияБоту.ТекстСообщения КАК ТекстСообщения,
	|	ВКМ_ТекстУведомленияБоту.Ссылка КАК Ссылка,
	|	ВКМ_ИдентификаторГруппы.Значение КАК ИдентификаторГруппы,
	|	ВКМ_ТокенБота.Значение КАК ТокенБота
	|ИЗ
	|	Справочник.ВКМ_ТекстУведомленияБоту КАК ВКМ_ТекстУведомленияБоту,
	|	Константа.ВКМ_ИдентификаторГруппы КАК ВКМ_ИдентификаторГруппы,
	|	Константа.ВКМ_ТокенБота КАК ВКМ_ТокенБота";

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		TokenTG = ВыборкаДетальныеЗаписи.ТокенБота;
		ChatID = ВыборкаДетальныеЗаписи.ИдентификаторГруппы;
		ТекстСообщения = ВыборкаДетальныеЗаписи.ТекстСообщения;

		АдресТГ = "api.telegram.org";
		Соединение = Новый HTTPСоединение(АдресТГ, 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);

		Данные = Новый Структура;
		Данные.Вставить("text", ТекстСообщения);

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();

		Заголовки = Новый Соответствие;
		Заголовки.Вставить("content-type", "application/json");

		АдресЗапроса = "bot" + TokenTG + "/sendMessage?chat_id=" + Формат(ChatID, "ЧГ=");
		Запрос = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);

		Результат = Соединение.ОтправитьДляОбработки(Запрос);

		Если Результат.КодСостояния = 200 Тогда
			
			КодСостояния = "200";
			Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Объект.Удалить();
			
		Иначе
			
			КодСостояния = "400";;
				
		КонецЕсли;
		
	КонецЦикла;

Возврат КодСостояния;

КонецФункции

#КонецОбласти