#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВКМ_КоличествоДнейОтпуска
	Движения.ВКМ_КоличествоДнейОтпуска.Записывать = Истина;
	
	Для Каждого Строка из ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_КоличествоДнейОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ВсегоДней = Строка.ВсегоДнейОтпуска;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

