
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнениеДанныхТГ();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключиться(Команда)
	
	КодСостояния = Неопределено;
	ПодключитьсяНаСервере(КодСостояния)
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Команда)
	
	СохранитьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДанные(Команда)
	
	УдалитьДанныеНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодключитьсяНаСервере(КодСостояния)
	
	СохранитьДанныеНаСервере();
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторГруппы) И ЗначениеЗаполнено(Объект.ТокенБота) Тогда
		
		ВКМ_ОтправкаСообщенияТГ.ОтправитьСообщениеТГ(КодСостояния);
		
		Если КодСостояния = "200" Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Статус: Сообщения успешно отправлены";
			Сообщение.Сообщить();
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Статус: При отправке сообщений произошла ошибка";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Статус: Заполните необходимые поля";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнениеДанныхТГ()
	
	Объект.ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппы.Получить();
	Объект.ТокенБота = Константы.ВКМ_ТокенБота.Получить();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеНаСервере()
	
	Константы.ВКМ_ИдентификаторГруппы.Установить(Объект.ИдентификаторГруппы);
	Константы.ВКМ_ТокенБота.Установить(Объект.ТокенБота);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДанныеНаСервере()
	
	Объект.ИдентификаторГруппы = Неопределено;
	Объект.ТокенБота = Неопределено;
	СохранитьДанныеНаСервере();

КонецПроцедуры

#КонецОбласти

