
//Добавление функции 
//Макаров А.С. 
//04.05.2024

//Принимает параметры из модуля объекта, создает новые документы реализации товаров и услуг
#Область СлужебныеПроцедурыИФункции

Функция СозданиеАктовРеализацииУслуг(Параметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_СозданныеДокументы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка)
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботы.Клиент КАК Контрагент,
	|	МАКСИМУМ(ВКМ_ВыполненныеКлиентуРаботы.Договор) КАК Договор,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СозданныеДокументы КАК ВТ_СозданныеДокументы
	|			ПО (ВТ_СозданныеДокументы.Договор = ДоговорыКонтрагентов.Ссылка)
	|		ПО (ВКМ_ВыполненныеКлиентуРаботы.Договор = ДоговорыКонтрагентов.Ссылка)
	|ГДЕ
	|	ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ДоговорыКонтрагентов.Ссылка В
	|		(ВЫБРАТЬ
	|			ВТ_СозданныеДокументы.Договор КАК Договор
	|		ИЗ
	|			ВТ_СозданныеДокументы КАК ВТ_СозданныеДокументы)
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеКлиентуРаботы.Клиент,
	|	ДоговорыКонтрагентов.Организация";

	Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Параметры.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.Период));

	Результат = Новый Массив;

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		НовыйДокумент.Организация = ВыборкаДетальныеЗаписи.Организация;
		НовыйДокумент.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		НовыйДокумент.Договор = ВыборкаДетальныеЗаписи.Договор;
		НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);

		Если Не НовыйДокумент.ПроверитьЗаполнение() Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка, не все реквизиты заполнены";
			Сообщение.Сообщить();
			Продолжить;

		КонецЕсли;

		Запись = Новый Структура;
		Запись.Вставить("Договор", НовыйДокумент.Договор);
		Запись.Вставить("Ссылка", НовыйДокумент.Ссылка);
		Результат.Добавить(Запись);

	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

//КонецРедактирования
//Макаров А.С.
//04.05.2024
