
#Область ОбработчикиСобытийФормы

//Добавление процедуры
//Макаров А.С. 
//26.04.2024

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Элементы.Найти("ВКМ_ЕжемесячнаяАбоненскаяПлата") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_ЕжемесячнаяАбоненскаяПлата", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ЕжемесячнаяАбоненскаяПлата";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Ежемесячная абоненская плата";
	КонецЕсли;

	Если Элементы.Найти("ВКМ_СтавкаЗаЧас") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_СтавкаЗаЧас", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтавкаЗаЧас";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Ставка за час";
	КонецЕсли;

	Если Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Дата начала действия договора";
	КонецЕсли;

	Если Элементы.Найти("ВКМ_ДатаОкончанияДействияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Дата окончания действия договора";
	КонецЕсли;

КонецПроцедуры

//Конец редактирования 
//Макаров А.С. 
//26.04.2024

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//Добавление процедуры
//Макаров А.С. 
//26.04.2024

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	ВКМ_ДобавлениеЭлементовНаФорму();

КонецПроцедуры

//Конец редактирования 
//Макаров А.С. 
//26.04.2024

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Добавление процедуры
//Макаров А.С. 
//26.04.2024

&НаСервере
Процедура ВКМ_ДобавлениеЭлементовНаФорму()

	Если Объект.ВидДоговора = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда

		Элементы.ВКМ_СтавкаЗаЧас.Видимость = Истина;
		Элементы.ВКМ_ЕжемесячнаяАбоненскаяПлата.Видимость = Истина;
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;

	Иначе

		Элементы.ВКМ_СтавкаЗаЧас.Видимость = Ложь;
		Элементы.ВКМ_ЕжемесячнаяАбоненскаяПлата.Видимость = Ложь;
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;

	КонецЕсли;
	
КонецПроцедуры

//Конец редактирования 
//Макаров А.С. 
//26.04.2024

#КонецОбласти
